Revit 2027 API
TargetRebarEdge Constructor
 Constructs a new instance of TargetRebarEdge.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TargetRebarEdge(
	Rebar targetRebar,
	int targetEdgeIndex
)
Public Sub New (
	targetRebar As Rebar,
	targetEdgeIndex As Integer
)
public:
TargetRebarEdge(
	Rebar^ targetRebar,
	int targetEdgeIndex
)
new :
        targetRebar : Rebar *
        targetEdgeIndex : int -> TargetRebarEdge
Parameters
targetRebar Rebar
 The target Rebar.
targetEdgeIndex Int32
 Identifies the index of the target Rebar's edge. The index should be between 0 and centerlines.Count - 1, where centerlines are computed by suppressing hooks, cranks and fillets for the first bar in the target set.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  targetEdgeIndex is not a valid edge index for the rebar. It should be between 0 and centerlines.Count - 1, where centerlines are computed by suppressing hooks, cranks and fillets for the first bar in set.
See Also
Reference
TargetRebarEdge Class
Autodesk.Revit.DB.Structure Namespace